nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [ 3,4, 6,5, 4,8 ]         # 4
  - [ 7,12, 11,7, 11,13 ]     # 8
  - [ 21,10, 13,21, 30,17 ]   # 16
  - [ 29,32, 48,42, 90,73 ]   # 32



# [from, number, module, args]
#  [-1, n, ConvLayer, [out, kernel_size, stride, ]]
#  [-1, n, InvertedResidual, [out, stride, expand_ration]]
#  [-1, n, MobileViTBlock, [TF_dim, ffn_dim,n_TFB,attn_dp, dp, ffn_dp,ph, pw]]


backbone:
  [
    # conv1
    [-1, 1, ConvLayer, [16, 6, 2]],                                 # 0   2
    # layer1
    [-1, 1, InvertedResidual, [32, 1, 4]],                          # 1   2
    # layer2
    [-1, 1, InvertedResidual, [64, 2, 4]],                          # 2   4
    [-1, 2, InvertedResidual, [64, 1, 4]],                          # 3   4
    # layer3
    [-1, 1, InvertedResidual, [96, 2, 4]],                          # 4   8
    [-1, 1, MobileViTBlock, [144, 288, 2, 0, 0, 0, 2, 2]],        #  5   8
    # layer4
    [-1, 1, InvertedResidual, [128, 2, 4]],                         # 6   16
    [-1, 1, MobileViTBlock, [192, 384, 4, 0, 0, 0, 2, 2]],        # 7   16
    # layer5
    [-1, 1, InvertedResidual, [160, 2, 4]],                         # 8   32
    [-1, 1, MobileViTBlock, [240, 480, 3, 0, 0, 0, 2, 2]],        # 9   32
    # SPPF
    [ -1, 1, SPPF, [ 160, 5 ] ],                                    # 10
  ]

head:
  [[-1, 1, Conv, [128, 1, 1]],                                      # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],                      # 12
   [[-1, 7], 1, Concat, [1]],                                       # 13
   [-1, 1, C3, [128, False]],                                       # 14

   [-1, 1, Conv, [96, 1, 1]],                                       # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],                      # 16
   [[-1, 5], 1, Concat, [1]],                                       # 17
   [-1, 1, C3, [96, False]],                                        # 18

   [ -1, 1, Conv, [ 64, 1, 1 ] ],                                   # 19
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],                  # 20
   [ [ -1, 3 ], 1, Concat, [ 1 ] ],                                 # 21
   [ -1, 1, C3, [64, False]],                                       # 22

   [ -1, 1, Conv, [ 64, 3, 2 ] ],                                   # 23
   [ [ -1, 19 ], 1, Concat, [ 1 ] ],                                # 24
   [ -1, 1, C3, [96, False]],                                       # 25

   [-1, 1, Conv, [96, 3, 2]],                                       # 26
   [[-1, 15], 1, Concat, [1]],                                      # 27
   [-1, 1, C3, [128, False]],                                       # 28

   [-1, 1, Conv, [128, 3, 2]],                                      # 29
   [[-1, 11], 1, Concat, [1]],                                      # 30
   [-1, 1, C3, [160, False]],                                       # 31

   [[22, 25, 28, 31], 1, Detect, [nc, anchors]],
  ]